In [1]:
import pandas as pd

CSV

In [2]:
df_csv = pd.read_csv('../../Pliki/02_pandas/people.csv')    # import pliku csv
df_csv

       Name  Age       Location      Occupation  Salary
0     Alice   28       New York        Engineer   80000
1       Bob   35    Los Angeles          Doctor  120000
2   Charlie   22        Chicago         Student       0
3     David   40  San Francisco         Manager   95000
4     Emily   29          Miami        Designer   75000
5     Frank   32         Boston         Teacher   60000
6     Grace   27        Seattle       Scientist  110000
7    Hannah   45         Dallas          Lawyer  130000
8       Ian   31         Denver          Writer   70000
9     Julia   24         Austin          Artist   55000
10    Karen   38        Houston      Accountant   90000
11     Liam   26        Phoenix    Photographer   50000
12    Megan   33       Portland       Architect  105000
13   Nathan   29        Atlanta        Musician   40000
14   Olivia   27        Detroit            Chef   65000
15     Paul   36    Minneapolis  Police Officer   85000

Excel import

In [4]:
df_excel =pd.read_excel('../../Pliki/02_pandas/products.xlsx')
df_excel

         Product             Category  Price  Stock
0         Laptop          Electronics   1200     50
1     Smartphone          Electronics    800    100
2        T-shirt             Clothing     25    300
3          Jeans             Clothing     60    150
4       Sneakers                Shoes     80    200
5     Headphones          Electronics    150     75
6       Backpack          Accessories     40    120
7           Desk            Furniture    250     30
8          Chair            Furniture    150     50
9         Guitar  Musical Instruments    300     40
10      Keyboard  Musical Instruments    200     60
11          Book                Books     15    500
12         Watch          Accessories    100     80
13    Sunglasses          Accessories     50    100
14     Microwave           Appliances    100     25
15  Refrigerator           Appliances    500     15